## Student Engagement
Here we will explore the data on student engagement

In [2]:
import pandas as pd
import numpy as np
%matplotlib inline
import matplotlib.pyplot as plt
import import_ipynb
from Student_info import country_Student
from Student_info import country_Student
from Student_info import student_info

importing Jupyter notebook from Student_info.ipynb
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35230 entries, 0 to 35229
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   student_id       35230 non-null  int64
 1   student_country  35217 non-null  object
 2   date_registered  35230 non-null  object
dtypes: int64(1), object(2)
memory usage: 825.8+ KB

In [3]:
student_engagement = pd.read_csv('dataSets/365_database/365_student_engagement.csv')
student_engagement.head()

,engagement_id,student_id,engagement_quizzes,engagement_exams,engagement_lessons,date_engaged
0,1,274999,1,1,1,2022-05-27
1,3,274501,0,0,1,2022-05-27
2,4,272842,1,1,1,2022-05-27
3,8,275173,0,0,1,2022-05-27
4,11,274876,0,1,0,2022-05-27

In [4]:
dates = pd.DataFrame(student_engagement['date_engaged'].value_counts())
dates.head()

            date_engaged
2022-08-16           808
2022-08-15           807
2022-08-17           749
2022-08-18           585
2022-10-10           402

### Date of engagement
- The above dataframe contains dates which appear in the student engagement dataframe.

- They are listed in descending order of engagement (i.e) The top most date is when most engagement happened, second date - second most and so on.

In [6]:
students = pd.DataFrame(student_engagement['student_id'].value_counts())
students

        student_id
269204         155
261682         139
264131         134
261905         133
260173         130
...            ...
274637           1
274638           1
274640           1
274644           1
295443           1

[18344 rows x 1 columns]

### Student Engagement
- The above dataframe contains students who appear in the student engagement dataframe.

- They are listed in descending order of engagement (i.e) The top most student has engaged the most, second top - second most and so on.

In [7]:
missing_country_df = student_info[student_info.isnull().any(axis=1)]
missing_country = missing_country_df['student_id'].tolist()
missing_country

[261725,
 262665,
 272144,
 278827,
 282654,
 282914,
 283704,
 283791,
 284550,
 284790,
 286959,
 290648,
 293967]

In [8]:
df = student_engagement.copy()

df_cleaned = df[~df['student_id'].isin(missing_country)]
student_engagement_cleaned = df_cleaned.reset_index(drop=True)
(student_engagement_cleaned)

,engagement_id,student_id,engagement_quizzes,engagement_exams,engagement_lessons,date_engaged
0,1,274999,1,1,1,2022-05-27
1,3,274501,0,0,1,2022-05-27
2,4,272842,1,1,1,2022-05-27
3,8,275173,0,0,1,2022-05-27
4,11,274876,0,1,0,2022-05-27
...,...,...,...,...,...,...
65320,2649439,295185,0,0,1,2022-10-20
65321,2649446,282935,0,1,1,2022-10-20
65322,2649658,292048,0,0,1,2022-10-20
65323,2649818,295443,0,0,1,2022-10-20
65324,2649873,284482,0,0,1,2022-10-20

In [9]:
country = []
i = 0
n = len(student_engagement_cleaned)-1

while (i<=n):
    x=student_engagement_cleaned['student_id'].loc[i]
    y=country_Student[x]
    country.append(y)
    i=i+1

In [10]:
len(country)
df_country = pd.DataFrame(country,columns = ['country'])
df_country

      country
0          TH
1          US
2          IN
3          NP
4          PK
...       ...
65320      AR
65321      BR
65322      CA
65323      GB
65324      US

[65325 rows x 1 columns]

In [16]:
frames = [student_engagement_cleaned, df_country]

student_engagement_by_country = pd.concat(frames,axis = 1)

most_engaged = student_engagement_by_country[(student_engagement_by_country['student_id']==276439) &( student_engagement_by_country['engagement_exams']==1)]

In [20]:
most_engaged[most_engaged['engagement_id'].duplicated()]

Empty DataFrame
Columns: [engagement_id, student_id, engagement_quizzes, engagement_exams, engagement_lessons, date_engaged, country]
Index: []